let Card = {
    card0: 'คุณได้ไพ่หมายเลข 0 "THE FOOL"<br>' +
        'เด็กหนุ่มผู้มีอิสระ ไร้เดียงสา พร้อมจะผจญภัยไปยังโลกกว้าง ก้าวเดินไปยังหน้าผาอันตราย อย่างไม่หวั่นเกรง พร้อมสุนัขคู่ใจตัวน้อยที่พร้อมปกป้องระหว่างทาง<br>' +
        'อ่านเพิ่มเติม : ' + '<a href="https://www.shitsuren-tarot.com/tarot/the-fool/" target="_blank"> คลิ๊กเลย </a>',
    card1: 'คุณได้ไพ่หมายเลข 1 "THE MAGICIAN"<br>' +
        '"จอมเวทย์ผู้มีความสามารถในการเชื่อมระหว่างโลกและจักรวาล ผู้มีเข้าใจในธรรมชาติและความสามารถในการควบคุมผสาน สรรสร้าง ทุกสรรพสิ่งจาก ดิน น้ำ ลม ไฟ"<br>' +
        'อ่านเพิ่มเติม : ' + '<a href="https://www.shitsuren-tarot.com/tarot/the-magician/" target="_blank"> คลิ๊กเลย </a>',
    card2: 'คุณได้ไพ่หมายเลข 2 "THE HIGH PRIESTESS"<br>' +
        '"ราชินีพระจันทร์ เทพธิดาผู้สามารถติดต่อกับโลกแห่งจิตวิญญาณและความจริง เป็นเจ้าลัทธิที่มีอำนาจลึกลับ ซับซ้อนของผู้หญิงซ่อนอยู่เบื้องหลังความไร้เดียงสา"<br>' +
        'อ่านเพิ่มเติม : ' + '<a href="https://www.shitsuren-tarot.com/tarot/the-high-priestess/" target="_blank"> คลิ๊กเลย </a>',
    card3: 'คุณได้ไพ่หมายเลข 3 "THE EMPRESS"<br>' +
        '"จักรพรรดินีผู้เลอโฉม และมีความเป็นแม่สูง นั่งอยู่สวนป่าที่มีความอุดมสมบูรณ์ เธอพร้อมที่จะหล่อเลี้ยงและให้กำเนิดสรรพสิ่ง พร้อมที่จะดูแลคนของเธอเป็นอย่างดี"<br>' +
        'อ่านเพิ่มเติม : ' + '<a href="https://www.shitsuren-tarot.com/tarot/the-empress/" target="_blank"> คลิ๊กเลย </a>',
    card4: 'คุณได้ไพ่หมายเลข 4 "THE EMPEROR"<br>' +
        '"จักรพรรดิผู้นิ่งสงบ การควบคุมคน ความนิ่ง ความมั่นคง ทำให้สามารถสยบโลกไว้ได้ด้วยอำนาจของตัวเอง ชายผู้มีความเป็นพ่อสูง พร้อมห่วงใยดูแลและปกป้อง"<br>' +
        'อ่านเพิ่มเติม : ' + '<a href="https://www.shitsuren-tarot.com/tarot/the-emperor/" target="_blank"> คลิ๊กเลย </a>',
    card5: 'คุณได้ไพ่หมายเลข 5 "THE HIEROPHANT"<br>' +
        '"สังฆราช ผู้ศึกษาความรู้ ธรรมเนียมปฏิบัติ เป็นผู้นำด้านความเชื่อ ความศรัทธา ผู้เคร่งครัดในจารีต พร้อมที่จะถ่ายทอดความรู้ความเชื่อให้เหล่าศิษย์ทั้งหลาย"<br>' +
        'อ่านเพิ่มเติม : ' + '<a href="https://www.shitsuren-tarot.com/tarot/the-hierophant/" target="_blank"> คลิ๊กเลย </a>',
    card6: 'คุณได้ไพ่หมายเลข 6 "THE LOVERS"<br>' +
        '"เรื่องราวของอดัม กับ อีฟ ในสวนอีเดน ที่พระเจ้าได้ให้ทั้งคู่เป็นคู่ครองกันและอยู่อย่างมีความสุข แต่งูก็ได้เสนอผลไม้แห่งความรู้ซึ่งเป็นผลไม้ต้องห้ามที่พระเจ้าได้ห้ามไว้  ถึงทางเลือกที่พวกเขาจะต้องเลือก"<br>' +
        'อ่านเพิ่มเติม : ' + '<a href="https://www.shitsuren-tarot.com/tarot/the-lovers/" target="_blank"> คลิ๊กเลย </a>',
    card7: 'คุณได้ไพ่หมายเลข 7 "THE CHARIOT"<br>' +
        '"อัศวินรถม้าผู้ที่สามารถควบคุมรถม้าไปได้ด้วยพละกำลัง พร้อมมุ่งหน้าเข้าประจันข้าศึก โดยไม่เกรงกลัวต่อสิ่งใด "<br>' +
        'อ่านเพิ่มเติม : ' + '<a href="https://www.shitsuren-tarot.com/tarot/the-chariot/" target="_blank"> คลิ๊กเลย </a>',
    card8: 'คุณได้ไพ่หมายเลข 8 "STRENGTH"<br>' +
        '"หญิงสาวลูบหัวและคางของสิงโตด้วยใบหน้ายิ้มอย่างสงบ ซึ่งสิงโตก็ยอมเธอ โดยที่เธอไม่จำเป็นต้องออกแรงใดๆ"<br>' +
        'อ่านเพิ่มเติม : ' + '<a href="https://www.shitsuren-tarot.com/tarot/strength/" target="_blank"> คลิ๊กเลย </a>',
    card9: 'คุณได้ไพ่หมายเลข 9 "THE HERMIT"<br>' +
        '"นักพรตผู้ออกเดินทางปลีกวิเวกขึ้นเขาไปเพียงลำพัง ค้นหาตัวเอง และเพื่อมองโลกในมุมที่กว้างกว่า"<br>' +
        'อ่านเพิ่มเติม : ' + '<a href="https://www.shitsuren-tarot.com/tarot/the-hermit/" target="_blank"> คลิ๊กเลย </a>',
    card10: 'คุณได้ไพ่หมายเลข 10 "WHEEL OF FORTUNE"<br>' +
        '"วงล้อแห่งโชคชะตา ที่กำลังหมุนไป ส่งผลให้ชีวิตนั้นหมุนตามไปด้วย"<br>' +
        'อ่านเพิ่มเติม : ' + '<a href="https://www.shitsuren-tarot.com/tarot/wheel-of-fortune/" target="_blank"> คลิ๊กเลย </a>',
    card11: 'คุณได้ไพ่หมายเลข 11 "JUSTICE"<br>' +
        '"ผู้พิพากษาที่ตัดสินทุกอย่างด้วยความยุติธรรม มือขวาของเธอถือดาบพร้อมฟาดฟันตัดสิน มือซ้ายถือตาชั่งที่แสดงถึงความยุติธรรม เท่าเทียม ไม่โอนเอียง"<br>' +
        'อ่านเพิ่มเติม : ' + '<a href="https://www.shitsuren-tarot.com/tarot/justice/" target="_blank"> คลิ๊กเลย </a>',
    card12: 'คุณได้ไพ่หมายเลข 12 "THE HANGED MAN"<br>' +
        '"ชายผู้ถูกห้อยหัว ให้ทรมาน แต่ท่าทางของเขากลับทำให้รู้ว่าเขาไม่เป็นไร ด้วยขาที่ขัดกันเป็นเลข 4 ซึ่งมีความหมายถึงความสมดุล สงบนิ่ง และแสงล้อมรอบหัวหมายถึงการตระหนักรู้"<br>' +
        'อ่านเพิ่มเติม : ' + '<a href="https://www.shitsuren-tarot.com/tarot/the-hanged-man/" target="_blank"> คลิ๊กเลย </a>',
    card13: 'คุณได้ไพ่หมายเลข 13 "DEATH"<br>' +
        '"ยมทูตผู้มอบความตายแก่ทุกคนไม่เว้นแม้แต่จักรพรรดิ ได้เดินทางมาเพื่อจะมอบความตายให้แม่และเด็ก แต่ทว่าพระสังฆราชได้มาเจรจาให้หยุดยั้งไว้"<br>' +
        'อ่านเพิ่มเติม : ' + '<a href="https://www.shitsuren-tarot.com/tarot/death/" target="_blank"> คลิ๊กเลย </a>',
    card14: 'คุณได้ไพ่หมายเลข 14 "TEMPERANCE"<br>' +
        '"เทวดาผู้ที่ยืนอยู่ตรงริมฝั่ง เท้าข้างนึงอยู่ในน้ำ เท้าข้างนึงอยู่บนพื้นดิน  กำลังทำการทดลองผสมน้ำจากถ้วยสองถ้วย ถ้วยนึงเย็น ถ้วยนึงร้อน เข้าด้วยกัน"<br>' +
        'อ่านเพิ่มเติม : ' + '<a href="https://www.shitsuren-tarot.com/tarot/temperance/" target="_blank"> คลิ๊กเลย </a>',
    card15: 'คุณได้ไพ่หมายเลข 15 "THE DEVIL"<br>' +
        '"ปีศาจผู้ควบคุมให้คนสองคน ชายและหญิงมาผูกมัดกันด้วยโซ่ แต่ทว่าโซ่ที่มัดหลวมนี้อันที่จริงไม่ได้ผูกมัดทั้งสองคนไว้ แต่เป็นสิ่งที่อยู่ลึกลงไปในจิตใจที่ทำให้คนสองคนยังผูกติดกันอยู่"<br>' +
        'อ่านเพิ่มเติม : ' + '<a href="https://www.shitsuren-tarot.com/tarot/the-devil/" target="_blank"> คลิ๊กเลย </a>',
    card16: 'คุณได้ไพ่หมายเลข 16 "THE TOWER"<br>' +
        '"หอคอยที่สร้างอยู่บนยอดเขา อันไม่มั่นคง โดนฟ้าผ่าพังทลายลงมา คนสองคนจึงต้องกระโดดหนีตาย ลงมาจากหอคอยนั้น โดยไม่แน่ใจว่าเบื้องล่างจะเป็นพื้นดิน หรือน้ำ"<br>' +
        'อ่านเพิ่มเติม : ' + '<a href="https://www.shitsuren-tarot.com/tarot/the-tower/" target="_blank"> คลิ๊กเลย </a>',
    card17: 'คุณได้ไพ่หมายเลข 17 "THE STAR"<br>' +
        '"แสงจากดวงดาวอันสุกใส ส่องให้เห็น หญิงสาวที่ริมน้ำ เธอเทโหลใส่น้ำสองใบ ใบนึงเทไปบนพื้นดินก่อให้เกิดการกำเนิดต้นไม้มากมาย  ใบนึงเทลงในน้ำเพื่อเติมเต็มและก่อให้เกิดการหมุนเวียน"<br>' +
        'อ่านเพิ่มเติม : ' + '<a href="https://www.shitsuren-tarot.com/tarot/the-star/" target="_blank"> คลิ๊กเลย </a>',
    card18: 'คุณได้ไพ่หมายเลข 18 "THE MOON"<br>' +
        '"แสงจากดวงจันทร์ ที่สะท้อนมาจากแสงอาทิตย์ ได้เปิดเผยความมืดมิดที่ปิดบังไว้ ความกังวล ความกลัว หลายสิ่งหลายอย่างที่เก็บซ่อนไว้ภายในกำลังจะเปิดเผยขึ้นมา"<br>' +
        'อ่านเพิ่มเติม : ' + '<a href="https://www.shitsuren-tarot.com/tarot/the-moon/" target="_blank"> คลิ๊กเลย </a>',
    card19: 'คุณได้ไพ่หมายเลข 19 "THE SUN"<br>' +
        '"ดวงอาทิตย์อันสดใส ส่องแสงสว่างไปยังทุกแห่งหน เด็กน้อยผู้นำความร่าเริงถือธงสีแดงบนม้ากำลังเข้ามา เบื้องหลังเป็นดอกทานตะวันที่บ่งบอกถึงความหวัง"<br>' +
        'อ่านเพิ่มเติม : ' + '<a href="https://www.shitsuren-tarot.com/tarot/the-sun/" target="_blank"> คลิ๊กเลย </a>',
    card20: 'คุณได้ไพ่หมายเลข 20 "JUDGEMENT"<br>' +
        '"วันพิพากษา เหล่าผู้วายชนม์ที่ลุกขึ้นมาเพื่อรอฟังเสียงแตรของเทพกาเบรียลในวันพิพากษา ใครจะได้ขึ้นสวรรค์ ใครจะตกนรกขึ้นอยู่กับสิ่งที่ได้ทำมา"<br>' +
        'อ่านเพิ่มเติม : ' + '<a href="https://www.shitsuren-tarot.com/tarot/judgement/" target="_blank"> คลิ๊กเลย </a>',
    card21: 'คุณได้ไพ่หมายเลข 21 "THE WORLD"<br>' +
        '"หญิงสาวที่เต้นระบำอยู่บนฟ้าอย่างร่าเริง โดยมีวงแหวนแห่งความสำเร็จล้อมรอบอยู่  สัญลักษณ์ตรงมุมทั้งสี่มุม แทนธาตุทั้งสี่ธาตุและหมายถึงไพ่ทั้งสี่ชนิด เหรียญ ไม้ ดาบ ถ้วย"<br>' +
        'อ่านเพิ่มเติม : ' + '<a href="https://www.shitsuren-tarot.com/tarot/the-world/" target="_blank"> คลิ๊กเลย </a>'

}

function openCard() {
    let random = Math.floor(Math.random() * 21);
    drawCard(random);

}

function drawCard(cardNum) {
    let cardGet = Card[`card${cardNum}`];
    document.getElementById("myCard").innerHTML = cardGet;
}